{
	"id": "0135c838-8fd4-2ab4-2182-71ef1ebbb7bf",
    "jobFunction": {
        "id": 23,
        "name": "Pre-Sales",
        "mnemonicBase": "S",
        "track": 0
    },
    "sections": [
        {
            "caption": null,
            "rows": [
                {
                    "name": "Experience and Knowledge",
                    "cells": [
                        "<p>Entry level position. Ideally a graduate or junior specialist with 1-2 years of lead generation, telemarketing or account development experience with a technical or business degree.</p>",
                        "<p>At least 3 years’ in presales/sales, project management or strategic consultancy experience, preferably in a technology-based organization.</p><p> </p>",
                        "<p>At least 5 years of experience in a client facing role and supporting sales function in securing new revenues across a technically advanced product suite and services.</p>",
                        "<p>At least 7 years of technical pre-sales management experience. Solid understanding of the IT market, industry trends and technical innovations.</p><p> </p>",
                        "<p>Professional with at least 9 years’ of proven sales or pre-sales solution experience in generating new business, leading pre-sales team and creating and maintain trusting relationships with key decision makers.</p>"
                    ]
                },
                {
                    "name": "Software Process Knowledge",
                    "cells": [
                        "<p>Good understanding of the full life cycle of standard software implementation projects. Experience of MS Office applications in particular Excel, Outlook, Word, and PowerPoint.</p>",
                        "<p>Understanding and experience of customer relationship database management software such as Salesforce and Microsoft Dynamics CRM.</p>",
                        "<p>Strong technical aptitude coupled with strong understanding of business value.</p>",
                        "<p>Follows, understands, and enhances defined software development processes.</p>",
                        "<p>Follows, understands, actively influences and enhances defined software development processes.</p>"
                    ]
                },
                {
                    "name": "Design and Documentation Skills ",
                    "cells": [
                        "<p>Coordinates preparation of presentations, demos, pitches, email campaigns and customer proposals. Responding to basic and routine client enquiries.</p>",
                        "<p>Oversee preparation of business' value propositions, Requests for Information (RFI) and Requests for Proposals (RFPs) and able to present those to prospective customers. Required to use Microsoft Dynamics or any other sales CRMs system to maintain accurate records and internal communications. Ability to design re-usable collateral (demos, brochures, etc.) that can be tailored as required for different customer’s opportunities. Designs and develop technical presentations and Proof-of-Concepts (POCs) documentation.</p>",
                        "<p>Collaborate and create strategic proposals and scope of services definitions. Develops tailored and customized solutions to meet client needs. Write technical proposals, tenders, reports and supporting literature. Develop and maintain an accurate and robust presales reporting methodology.</p>",
                        "<p>Develops action plans and implements presales strategies to achieve targets and service goals for large and complex client accounts. Builds and maintains reports to track the pipeline of new business opportunities and leads that delivers the pre-sales targets.</p>",
                        "<p>Sets, leads and oversees the pre-sales plans, policies, and programs in conjunction with the Sales team and the IBU heads. Full responsibility for creating and monitoring the presales function P&L, annual revenue targets, global pre-sales forecasts and budgets.</p>"
                    ]
                },
                {
                    "name": "Job Title",
                    "cells": [
                        "<p>Associate Pre-Sales Consultant</p>",
                        "<p>Pre-sales Consultant</p>",
                        "<p>Senior Pre-Sales Consultant</p>",
                        "<p>Lead Pre-Sales Consultant</p>",
                        "<p>Principal Pre-sales Consultant</p>"
                    ]
                },
                {
                    "name": "Responsibilities",
                    "cells": [
                        "<p>Under supervision will be able to provide comprehensive pre-sales support to the Business Development teams in order to aid new client acquisition. Able to complete the functional sections of requests for Information/Proposals and respond to web inquiries and referrals. Create offline and online presentations featuring the company values, experience and services. Assist with annual trade shows and client events.</p>",
                        "<p>Responsible for interfacing with prospective and current customers, distributors and partners (both at business and technical level) and recommend system solutions and services. Comfortable translating and mapping business requirements into possible technical capabilities and services, suggesting delivery methodologies, defining financial models, prerequisites and dependencies of a successful engagement. Evaluates new leads, develops trusted relationships and gains client interest and commitment. Able to provide quick and accurate responses to functional and technical elements of RFPs/RFQs/ RFIs preparing and presenting compelling presales demonstrations.</p>",
                        "<p>Responsible for business development process and business proposals creation including lead qualification, elaboration of the company offering, value proposition and final deal closure. Integrate technical solution implementation approach into business proposals, build pricing models based on technical estimates, timelines and cost analyses. Coordinating and integrating business development pre-sales activities across multiple organizational units and divisions and defining and driving technology roadmaps, coordinating and integrating overall solutions connecting multiple competencies together. Overseeing the technical response to RFPs/RFIs and is the first point of contact for the sales managers on all pre-sales related enquiries.</p>",
                        "<p>Responsible for coordinating all pre-sales activities and manage presales consultants and technical implementation specialist. Direct and manage all cross-functional pre-sales in order to achieve business objectives.</p><p>In partnership with the Sales and Marketing teams creates business and account development plans. Oversees the development of key business opportunities and identify opportunities for new areas of business development. Oversee the sales intelligence with the sales teams and maintain up-to-date competitor’s reports and statistics. Establish clear and measurable goals for achieving set KPIs. Acts as primary escalation point for customer and pre- sales issues and enquiries.</p>",
                        "<p>Actively partner with the sales and company management teams in attainment of country (or regional) sales goals. Maintain and constantly improve the organization's competitive position. An inspirational leader, able to motivate, influence, manage and direct an internationally based pre-sales teams. Responsible for the professional development (skills, knowledge, tools, and processes) of the pre-sales specialists. Collaborate with regional Sales Executives and Pre-Sales Engineers to create and implement overall technical sales strategies.</p>"
                    ]
                },
                {
                    "name": "Roles Played on a Project",
                    "cells": [
                        "<p>Plays Consultant role</p>",
                        "<p>Plays Consultant role</p>",
                        "<p>Plays the Key Consultant role.</p><p>May sometimes play Consultant Team Lead and Project Coordinator role.</p>",
                        "<p>Plays the Key Consultant role.</p><p>Usually also performs a Consultant Team Lead, Project Coordinator, Mentor, Reviewer or Auditor role.</p>",
                        "<p>Can play any role, typically a senior position (Team Leader, Architect, Reviewer, Auditor, Technical Trainer, etc.)</p>"
                    ]
                },
                {
                    "name": "Reliability",
                    "cells": [
                        "<p>Expected to work effectively under supervision. Ability to learn quick new products and services and demonstrate these articulately. Able to organize, prioritize, and multi-task. Enthusiastic, team player with a can-do attitude and strong work ethic.</p>",
                        "<p>Ability to work independently and maintain accountability. Understanding of the entire sales cycle, from market research through to contract signing. Strong communication, presentation and negotiation skills (verbal and written).</p>",
                        "<p>Able to maintain a high level of productivity and work effectively in a fast-paced, collaborative and team oriented environment. Provide guidance and advice to less experienced pre-sales consultants.</p>",
                        "<p>Develop and sets quality metrics (annual targets), procedures and guidelines. Excellent negotiation, influence, mediation and conflict management skills.</p>",
                        "<p>Lead a pre-sale global functional teams and plays key role in the business development function.</p>"
                    ]
                },
                {
                    "name": "Quality",
                    "cells": [
                        "<p>Understands and follows the quality metrics, procedures and guidelines to promote and present the organization's products and services. Gains planned results and provides good quality of performed tasks under regular supervision of senior consultants.</p>",
                        "<p>Further develop pre-sales skills and deeper knowledge of the organization's products, services, and customers by working closely with other pre-sales and sales representatives on local and global level. </p>",
                        "<p>Able to coach pre-sales representatives on technical aspects of the organization's products and services; marketing campaigns; presales promotions; and on pre-sales techniques, procedures, and standards that will help them achieve their targets and KPIs.</p>",
                        "<p>Develop and sets quality metrics (annual targets), procedures and guidelines. Strong problem solving skills with an ability to assess a problem/need and determine and effective course of action.</p>",
                        "<p>Thought leader and subject matter expert on technical pre-sales and field consulting matters. Reflect high standards of excellence and lead by example.</p>"
                    ]
                },
                {
                    "name": "Customer Relations",
                    "cells": [
                        "<p>Able to communicate directly with some customers.</p>",
                        "<p>Able to communicate directly and independently with customers and have an ability to deliver a tailored pre-sales process. Ability to communicate in a confident and well-presented manner. Understands the customers' processes (including decision criteria and influence matrix) and shares and compares knowledge with extended sales and pre-sales teams.</p>",
                        "<p>Excellent communicator who is able to maintain good working relationship with various shareholders and work in a fast-paced environment, with strict timescales. Excellent customer facing skills and ability to articulate at a senior level.</p><p> </p>",
                        "<p>Able to manage a group of customers to achieve designated pre-sales target levels. Strong Presentation Skills and ability to present and demonstrate value of solution to all levels in a client’s organization, from users to executive management.</p><p> </p><p> </p>",
                        "<p>Able to manage multiple regional and global accounts and pre-sales teams.</p><p> </p>"
                    ]
                },
                {
                    "name": "English Language Ability",
                    "cells": [
                        "<p>B1</p>",
                        "<p>B2</p>",
                        "<p>C1</p>",
                        "<p>C1</p>",
                        "<p>C1</p>"
                    ]
                }
            ]
        }
    ],
    "levels": [
        {
            "level": 1,
            "isEligibleForAsmt": false,
            "jobTitles": [
                "Associate Pre-sales Consultant"
            ]
        },
        {
            "level": 2,
            "isEligibleForAsmt": false,
            "jobTitles": [
                "Pre-Sales Consultant"
            ]
        },
        {
            "level": 3,
            "isEligibleForAsmt": false,
            "jobTitles": [
                "Senior Pre-Sales Consultant"
            ]
        },
        {
            "level": 4,
            "isEligibleForAsmt": false,
            "jobTitles": [
                "Lead Pre-Sales Consultant"
            ]
        },
        {
            "level": 5,
            "isEligibleForAsmt": false,
            "jobTitles": [
                "Principal Pre-sales Consultant"
            ]
        }
    ]
}