{
	"id": "21c3e494-3713-f983-bea2-9e3a198f959a",
    "jobFunction": {
        "id": 30,
        "name": "Experience Architecture",
        "mnemonicBase": "XA",
        "track": 1
    },
    "sections": [
        {
            "caption": null,
            "rows": [
                {
                    "name": "Professional Experience and Knowledge",
                    "cells": [
                        "<p> </p>",
                        "<p> </p><p>Having at least 3 years of relevant experience. Highly proficient and developing or has developed a comprehensive knowledge of industry standard design tools and processes and having the ability to interface directly with clients to present design work without the support of an Account Manager.</p>",
                        "<p> </p><p>Having at least 3 years of relevant experience. Highly proficient and developing or has developed a comprehensive knowledge of industry standard design tools and processes and having the ability to interface directly with clients to present design work without the support of an Account Manager.</p>",
                        "<p>Having at least 5 years of relevant experience. Has proven depth and breadth of knowledge of industry standard design tools and processes. Recognized as an authority in multiple function areas. Must be able to manage / direct design teams on active projects including global team management. Experience leading client presentations, workshops, and discussions. Experience estimating the efforts for various project types. Understanding of the latest trends in design industry.</p>",
                        "<p> </p><p>Having at least 7 years of relevant design experience. Must be able to set design direction and process at a department level. Recognized as a resource for innovation and groundbreaking design. Experience with industry thought leadership including writing, speaking and teaching; Understanding of the latest trends in design industry.</p>"
                    ]
                },
                {
                    "name": "Design Process Knowledge",
                    "cells": [
                        "<p> </p>",
                        "<p>Expected to be able to follow and understand a defined design process.</p>",
                        "<p>Expected to be able to follow and understand a defined design process.</p>",
                        "<p>Expected to be able to follow, understand and enhance a defined design process.</p>",
                        "<p>Expected to be able to follow, understand, actively influence and enhance a defined design process.</p>"
                    ]
                },
                {
                    "name": "Design and Documentation Skills ",
                    "cells": [
                        "<p> </p>",
                        "<p> </p><p>Able to read and understand project and requirement documentation; able to create high-quality documentation of his/her designed deliverables: Ability to direct designers and interns/co-ops.</p>",
                        "<p> </p><p>Able to read and understand project and requirement documentation; able to create high-quality documentation of his/her designed deliverables: Ability to direct designers and interns/co-ops.</p>",
                        "<p> </p><p>Able to create, implement and enhance a new design processes. Contributes directly to project design. Mentors and coaches team members through design process and performance management.</p>",
                        "<p>Able to create, implement, and enhance a new design processes. Able to read and understand project and requirement documentation; able to create high-quality design documentation including documentation of process for client/global consumption; Mentors and coaches team members through design process and performance management.</p>"
                    ]
                },
                {
                    "name": "Business Domain Knowledge",
                    "cells": [
                        "<p> </p>",
                        "<p>Comprehensive experience working within multiple customer verticals.</p>",
                        "<p>Comprehensive experience working within multiple customer verticals.</p>",
                        "<p>Proven depth and breadth of knowledge of multiple customer verticals.</p>",
                        "<p>Expert knowledge of multiple customer verticals.</p>"
                    ]
                },
                {
                    "name": "Job Title",
                    "cells": [
                        "<p> </p>",
                        "<p>Art Director</p>",
                        "<p>Associate Creative Director</p><p>Associate Director, User Experience Design</p><p>Associate Director, Service Design</p><p>Associate Director, Content Strategy</p><p>Associate Director, Industrial Design</p>",
                        "<p> </p><p>Creative Director</p><p>Director, User Experience Design</p><p>Director, Service Design</p><p>Director, Content Strategy</p><p>Director, Industrial Design</p>",
                        "<p> </p><p>Group Creative Director</p><p>Senior Director, User Experience Design</p><p>Senior Director, Service Design</p><p>Senior Director, Content Strategy</p><p>Senior Director, Industrial Design</p>"
                    ]
                },
                {
                    "name": "Responsibility and Reliability",
                    "cells": [
                        "<p> </p>",
                        "<p>Independently create deliverables; Translate business requirements and specifications into usable, useful and desirable deliverables. Participate in new-business activities, presentations and estimates. Collaborate with design leadership on process; Present design work to internal team as well as clients without supervision. Ability to take direction and work effectively without supervision. Able to work with internal and external teams on multiple projects simultaneously, think and respond quickly to requests. Demonstrates high standards of workmanship, attention to detail and adherence to company process and industry standards/best practices.</p>",
                        "<p>Independently create deliverables; Translate business requirements and specifications into usable, useful and desirable deliverables.  Participate in new-business activities, presentations and estimates. Collaborate with design leadership on process; Present design work to internal team as well as clients without supervision. Ability to take direction and work effectively without supervision. Able to work with internal and external teams on multiple projects simultaneously, think and respond quickly to requests. Demonstrates high standards of workmanship, attention to detail and adherence to company process and industry standards/best practices.</p>",
                        "<p>Lead a team in the creation of deliverables; Lead design aspects of responsive-design projects; Serve as a Lead for new-business activities, presentations and estimates; Collaborate with creative leads on design process; Present design work to internal team as well as clients; Delegate work to more junior designers as needed/appropriate; Serve as thought leader in the field by writing, speaking and/or teaching.  Further the practice of design within; EPAM by sharing knowledge, updating the team on industry advances, and keeping abreast of latest trends. Deliver innovative strategic design solutions and develop client relationships.</p><p> </p><p>Establish direction and vision which mobilizes the design team(s) to meet clearly defined goals and targets. Help to recruit, manage, support, groom, inspire, and lead design team to creative solutions that fulfil client objectives. Expected to be self-managing / design without supervision. Ability to work on multiple projects simultaneously while maintaining absolute organization and prioritization under extreme pressure; Ability to think and respond quickly to client and internal team demands, while maintaining extraordinary attention to detail;  Responsible for design deliverables produced by more junior team members.</p>",
                        "<p>Serve as thought leader in the field by writing, speaking and/or teaching.  Further the practice of design within EPAM by sharing knowledge, updating the team on industry advances, and keeping abreast of latest trends. Be able to present and sell complex ideas and concepts to C-level stakeholders.</p><p> </p><p>Establish direction and vision which mobilizes the design team(s) to meet clearly defined goals and targets. Help to recruit, manage, support, groom, inspire, and lead design team to creative solutions that fulfill client objectives.  Expected to be self-managing, take responsibility for a subsystem or a whole project, and work without supervision. Ability to independently lead a department of designers. Responsible for the methodology creation/refinement/growth responsibilities for the design team to leverage.  Ability to work on multiple projects simultaneously while maintaining absolute organization and prioritization under extreme pressure; Ability to think and respond quickly to client and internal team demands, while maintaining extraordinary attention to detail;</p><p> </p><p>Must be a role model for colleagues, on a par with the best industry standards; creates deliverables in excellent quality.</p>"
                    ]
                },
                {
                    "name": "Roles played on the project",
                    "cells": [
                        "<p> </p>",
                        "<p>Design Lead</p>",
                        "<p>Design Lead</p>",
                        "<p>Design Lead</p>",
                        "<p>Design Lead</p>"
                    ]
                },
                {
                    "name": "Customer Relations",
                    "cells": [
                        "<p> </p>",
                        "<p>Significant experience in presenting work to/communicating with internal and external customers.</p>",
                        "<p> </p><p>Significant experience in presenting work to/communicating with internal and external customers.</p>",
                        "<p> </p><p>Expected to interface directly with clients by leading presentations, workshops and customer visits.</p>",
                        "<p> </p><p>Expected to be on a par with the best industry experts in customer relationship skills; interface directly with clients by leading presentations workshops and customer visits.</p>"
                    ]
                },
                {
                    "name": "English Language Level",
                    "cells": [
                        "<p> </p>",
                        "<p>C1</p>",
                        "<p>C1</p>",
                        "<p>C2</p>",
                        "<p>C2</p>"
                    ]
                }
            ]
        }
    ],
    "levels": [
        {
            "level": 1,
            "isEligibleForAsmt": false,
            "jobTitles": []
        },
        {
            "level": 2,
            "isEligibleForAsmt": true,
            "jobTitles": [
                "Art Director"
            ]
        },
        {
            "level": 3,
            "isEligibleForAsmt": true,
            "jobTitles": [
                "Associate Creative Director",
                "Associate Director, User Experience Design",
                "Associate Director, Service Design",
                "Associate Director, Industrial Design",
                "Associate Director, Content Strategy"
            ]
        },
        {
            "level": 4,
            "isEligibleForAsmt": true,
            "jobTitles": [
                "Director, User Experience Design",
                "Creative Director",
                "Director, Industrial Design",
                "Director, Service Design",
                "Director, Content Strategy"
            ]
        },
        {
            "level": 5,
            "isEligibleForAsmt": true,
            "jobTitles": [
                "Senior Director, Content Strategy",
                "Senior Director, Service Design",
                "Group Creative Director",
                "Senior Director, User Experience Design",
                "Senior Director, Industrial Design"
            ]
        }
    ]
}