{
    "jobFunction": {
        "id": 34,
        "name": "Agile Coach",
        "mnemonicBase": "AG",
        "track": 1
    },
    "sections": [
        {
            "caption": null,
            "rows": [
                {
                    "name": "Professional Experience and Knowledge",
                    "cells": [
                        "<p>Any current company employee with aspiration of becoming agile coach. Assisting and delivering: relevant experience with Agile projects (Scrum, and/or Kanban) or facilitating. Agile rituals; relevant experience with business and/or IT. Capable to assist a L2 or up in coaching, guiding/ coordinating/supporting individuals and a team of 5-20 people. Has an excellent understanding of Agile principles and values that are in alignment with the above mentioned Agile frameworks. Capable to mix and match leading practices.</p><p>Participant and contributor of \"Agile Ambassador's\" group.</p>",
                        "<p>At least 3 years of hands on delivering relevant experience with Agile projects (Scrum, and/or Kanban) and facilitating Agile rituals; relevant experience with business and/or IT.</p><p>Capable to coach (guide/coordinate/support) individuals and a team of 5-20 people without supervision.</p><p>Capable to create new models as per needs of the team.</p>",
                        "<p>At least 5 years of hands on relevant experience with Agile projects (Scrum, Kanban and scaled agile) and facilitating Agile rituals; relevant experience with business and/or IT.</p><p>Capable to coach (guide/coordinate/support) individuals, and multiple teams of 5-20 people/team without supervision.</p><p>Is familiar and understands the benefits of some of the Agile Scaling frameworks.</p><p>Capable to create new models as per needs of the teams.</p>",
                        "<p>At least 8 years of hands on relevant experience with Agile projects (Scrum, Kanban and scaled agile) and facilitating Agile rituals; relevant experience with business and IT.</p><p>Capable to coach (guide/coordinate/support) managers and teams from different areas of a department (not only IT).</p><p>Has a good understanding on benefits and implementation steps of some of the Agile Scaling frameworks</p><p>Capable to mix n' match leading practices from different Agile scaling frameworks</p><p>Industry presence is a must on this level.</p>",
                        "<p>At least 10 years of hands on experience with Agile projects working with  business and IT.</p><p>Capable to coach (guide/coordinate/support) managers and CxO leaders from an Enterprise level.</p><p>Excellent knowledge and understanding of Agile in scale, benefits and implementation of different frameworks.</p><p>Capable to create new models for scaling Agile as per the needs of  Enterprise clients</p><p>Industry presence is a must on this level.</p>"
                    ]
                },
                {
                    "name": "Leadership/Role-model",
                    "cells": [
                        "<p>Capable to assist in providing advice based on personal experience in agile project governance, communication with client, team and people at PM/PO level.</p><p>Skilled in communication of concepts and ideas, handling conflicts and taking on responsibility.</p><p>Respectful, resourceful and rewarding with the individuals and the team.</p><p>Implements measures to increase employee morale, motivation and satisfaction.</p>",
                        "<p>Capable to provide advice based on personal experience in agile project governance, communication with client, team and people at PO/PM level.</p><p>Proactive, confident, respectful, resourceful and rewarding with individuals and the team.</p><p>Develops and implements measures to increase employee morale, motivation and satisfaction.</p>",
                        "<p>Capable to provide advice based on personal experience in agile project governance, communication with client, teams and people at PO/PM, middle-management level and Program Management level.</p><p>Proactive, confident, respectful, resourceful and rewarding with individuals and teams.</p>",
                        "<p> A leader that is able to motivate and influence people on different levels of an organization. Can set up and run a PMO.</p><p>Experience in Agile project governance, communication with clients at different levels.</p><p>Proactive, confident, respectful, resourceful and rewarding with managers and their teams.</p>",
                        "<p>An inspirational leader, able to motivate, influence, manage and direct different areas of an Enterprise. </p><p>Capable to create more leaders. Able to act as \"Change Agent\" in Enterprise level, for different areas of the organization.</p><p>Experience in IT and non-IT project governance, communication with client at different levels.</p><p>Proactive, confident, respectful, resourceful and rewarding with CxOs and their teams</p>"
                    ]
                },
                {
                    "name": "Coaching Stance",
                    "cells": [
                        "<p>Familiar with some coaching techniques and mental models. Active listener. With assistance, can coach people on different roles on a team. Aims to add value to the team and can sense resistance.</p><p>Assistant when analyzing team's current situation and identify areas for improvement.</p><p>With assistance, runs complex tasks within a team, provides expertise and mentoring in challenging & brand new teams using agile practices for first time.</p><p>Capable to think outside of the box and consider different options </p><p>Assistant in these roles within a team:</p><p>Growth facilitator</p><p>Servant Leader</p><p>Mentor</p><p>Coach</p><p> </p>",
                        "<p>Capable to navigate unfamiliar circumstances. Able to challenge non- constructive thinking and manage resistance.</p><p>Capable to analyze team's current situation and identify areas for improvement.</p><p>Practitioner of different coaching techniques and mental models. Active listener. Can coach and mentor people with different roles on a team.</p><p>Leads complex tasks within a team, provides expertise and mentoring in challenging & brand new team using agile practices. Capable to navigate and deal with resistance on change without being discouraged.</p>",
                        "<p>Skilled achiever. Professionally navigates in unfamiliar circumstances. Able to challenge status -quo and non- constructive thinking. Can manage resistance and adjust approach to change.</p><p>Able to analyze multiple teams' current situation and identify areas for improvement within the team and their dependencies.</p><p>Leads complex projects across multiple teams, provides expertise and mentoring in challenging & brand new teams using agile practices. Capable to navigate and deal with resistance on change without being discouraged. Capable to navigate in environments where there is conflict of interest between influencers. </p>",
                        "<p>Skilled achiever. Capable to navigate and deal with resistance on change without being discouraged. Capable to adjust the approach and use different coaching models and mental models.</p><p>Capable to analyze the current situation and identify areas for improvement within an organization and management level</p><p>Capable to help at PMO level on generating options and setting up useful metric to measure success and trigger the positive behavior.</p><p>Aware of conflicts of interests between influencers to understand when and how much to challenge, force and execute a change in a PMO level. </p><p> </p><p> </p>",
                        "<p>Achieved leader. Capable to navigate and deal with resistance on change without being discouraged. Capable to adjust the approach and use different coaching models and mental models </p><p>Capable to analyze the current situation and identify areas for improvement within an Enterprise and leadership level.</p><p>Capable to help at Senior Leadership level on generating options and setting up useful metrics to measure success and trigger the positive behavior. Capable to influence the culture change.</p><p>Aware of conflicts of interests between influencers to understand when and how much to challenge, force and execute a change in Enterprise level.</p>"
                    ]
                },
                {
                    "name": "Job Title",
                    "cells": [
                        "<p>Agile Coach Assistant</p>",
                        "<p>Agile Coach</p>",
                        "<p>Senior Agile Coach</p>",
                        "<p>Lead Agile Coach</p>",
                        "<p>Chief Agile Coach</p>"
                    ]
                },
                {
                    "name": "Roles Played on a Project",
                    "cells": [
                        "<p>Agile Coach Assistant, Current assumed role on the project.</p>",
                        "<p>Agile Coach for one team, coach and mentor for L1 Agile Coach</p>",
                        "<p>Agile Coach for multiple teams, coach and mentor for L2 and L1 Agile Coach</p>",
                        "<p>Agile Coach for managers and teams of a department (not only IT), Leader/Coach for a group of coaches, mentor for L1,L2,L3 Agile Coach</p>",
                        "<p>Agile Coach for CxO level, Senior managers and Enterprise, Senior Leader/Coach for a group of coaches, mentor for L1,L2,L3,L4 Agile Coach</p>"
                    ]
                },
                {
                    "name": "Communication, Design and Documentation Skills ",
                    "cells": [
                        "<p>Ability to communicate confidently to present the information.</p><p>Capable to contribute in a clear way and concisely describe a concept, for example a blog post. Share info within a community.</p><p>Capable to help on pre-sale and training materials using samples and templates. Capable of creating Case Studies from his/her own experience with Agile projects.</p><p> </p>",
                        "<p>Ability to communicate confidently and align the content, the language and the media used to present the information.</p><p>Capable to develop in a clear way and concisely describe a concept, for example a blog post. Share info within a community.</p><p>Capable to prepare pre-sale and training materials with informative and current content as per the needs of clients.</p>",
                        "<p>Clearly understand the relevance and value of the information that needs to be communicated to certain audience. Ability to tailor the communication style to that audience.</p><p>Capable to lead pre-sale engagement for multiple teams from the Agile CC perspective. Develop training materials with informative and current content as per the needs of clients.</p><p>Capable to assist on building Community of Practice for different groups within an organization.</p>",
                        "<p>Clearly understand the relevance and value of the information that needs to be communicated to organizational leadership. Ability to tailor the communication style to that audience.</p><p>Capable to lead pre-sale engagement for organizational transformation needs from the Agile CC perspective.</p><p>Capable to build Community of Practice for different groups within an organization.</p>",
                        "<p>Clearly understand the relevance and value of the information that needs to be communicated to enterprise level. Ability to tailor the communication style to that audience.</p><p>Capable to engage at a meaningful discussion at the CxO level and tailor the message to focus on their area of interest/expertise.</p>"
                    ]
                },
                {
                    "name": "Self-development",
                    "cells": [
                        "<p>Initiates challenging status-quo of self - development, continuously identifies ideas for improvements on different areas.</p><p>Coaching and Agile related certifications are a plus but not decisive on the competency level.</p><p> </p>",
                        "<p>Understanding the newest development in the Agile community regarding team techniques and the ability to bring them to the team.</p><p>Always looking for new knowledge and use them on the right context.</p><p>Attends and/or speaks to conferences within EPAM or local communities</p><p>Initiates challenging status-quo of self - development, continuously identifies ideas for improvements on different areas.</p>",
                        "<p>Understanding the newest development in the Agile community regarding scaling techniques and the ability to bring them to multiple teams.</p><p>Always looking for new knowledge and using them on the right context.</p>",
                        "<p>Understanding the newest development in the Agile community regarding financial management, product development, talent acquisition, cultural transformation as well as  the ability to bring them to an organization.</p>",
                        "<p>A though leader in Agile community and within EPAM, brings cross-pollination from areas outside of Agile community and/or different industries and uses them in the right context.</p>"
                    ]
                },
                {
                    "name": "Organizational Impact/Responsibility and reliability ",
                    "cells": [
                        "<p>With guidance from a L2 and up, can provide guidance and be responsible for process and knowledge improvements on people from 1 team. Able to influence a change at an individual and the team level.</p><p>Able to assist on \"Coaches clinic\" sessions and help spreading Agile thinking.</p>",
                        "<p>Proven track record of leading a team and influencing improvements in the process and people's management. Able to identify, initiate and lead a change at the team level.</p><p>Demonstrated success in improving the communication between business and team.</p><p>Able to run \"Coaches clinic\" sessions and relating improvements to Agile thinking principles.</p>",
                        "<p>Experienced practitioner and expert in leading tactical approaches for people and cross- team development, create governance models for organizational change and management growth.</p><p>Confident leading people and influencing decisions at all levels across multiple teams up to Program manager.  Ability to prioritize accordingly.</p>",
                        "<p>Reflect high standards of excellence and leads by example. Liaise with organizational management to develop and implement strategies that are appropriate for their business needs and consistent with Agile principles. Ensures alignment with company's needs and expectations. Consult decisively, promptly and confidently.</p><p> </p>",
                        "<p>Reflect high standards of excellence in Enterprise leadership and leads by example. Liaise with executive leaders and managers to develop and implement strategies that are appropriate for their business needs and consistent with Agile principles. Ensures alignment with company's needs and expectations.</p><p> </p>"
                    ]
                },
                {
                    "name": "Customer Relations",
                    "cells": [
                        "<p>Capable to identify team stakeholders and understand their interests and priorities. No customer facing, unless supporting someone with more experience.</p><p>Capable to emulate and reinforce Agile principles on environments within the boundaries of 1 team. Reliable on keeping a team motivated and high morale on high pressure projects.</p>",
                        "<p>Capable to communicate directly and independently with customers and have an ability to deliver tailored Agile solutions for the team. </p><p>Capable to create, emulate and reinforce agile principles on environments within the boundaries of 1 team.</p><p>Reliable and leader on keeping a team motivated and high morale on high pressure projects.</p>",
                        "<p>Works closely with a variety of clients to ensure that Agile principles are aligned at all levels. Able to lead discussions with established customers and assist on discussions with new clients.</p><p>Understands the customers' processes (including decision criteria and influence matrix).</p><p>Excellent customer facing skills and ability to articulate at a Program management level.</p><p>Trustworthy adviser for different managers on the teams and functional roles.</p>",
                        "<p>Capable to develop strong relationships with clients across all levels of organization, all areas of business and supporting functions.</p><p>Capable to lead discussions with new and established clients.</p><p>Capable to design, create, emulate and reinforce agile principles on management environments.</p><p>Trustworthy adviser for different leadership roles within an organization.</p>",
                        "<p>Works closely with a variety of leaders at an Enterprise level. Able to develop strong relationships with clients across all levels of organization, all areas of business and supporting functions.</p><p>Capable to communicate directly and independently with customers and have an ability  to design, create, emulate and reinforce agile principles on management and leaders on client's organizations.</p><p>Trustworthy adviser for different CxO leaders within an organization.</p>"
                    ]
                },
                {
                    "name": "Technical Practices Knowledge ",
                    "cells": [
                        "<p>Capable to identify cases when a certain technical practice can help the team.</p><p>Capable to explain a couple of these practices and their benefits.</p>",
                        "<p>Capable to follow, understand, actively influence and enhance on the technical practices that would improve the team delivery. </p><p>Capable to work with technical leads and test automation leads.</p><p> </p>",
                        "<p>Capable to follow, understand, actively influence and enhance technical practices across multiple teams.</p><p>Capable to identify technical limitations of the teams and work with technical leads on improvements. Capable to work with technical leads in Devops/CI/CD environments and explain the benefits of those practices.</p>",
                        "<p> Capable to follow, understand, actively influence and enhance technical practices across an organization.</p><p>Capable to identify technical limitations of an organization, suggest technical practices that can be implemented and explain the benefits of each practice.</p><p>Capable to build a business case for an organization to implement technical practices.</p>",
                        "<p>Capable to understand, actively influence and enhance technical practices across an Enterprise including different IT areas (development, data, infrastructure, etc.).</p><p>Capable to build a business case to influence CxO's on investing on certain technical practices, as per the need of the customer.</p>"
                    ]
                },
                {
                    "name": "English Language ",
                    "cells": [
                        "<p>B2</p>",
                        "<p>B2</p>",
                        "<p>C1</p>",
                        "<p>C1</p>",
                        "<p>C1</p>"
                    ]
                }
            ]
        }
    ],
    "levels": [
        {
            "level": 1,
            "isEligibleForAsmt": true,
            "jobTitles": [
                "Agile Coach Assistant"
            ]
        },
        {
            "level": 2,
            "isEligibleForAsmt": true,
            "jobTitles": [
                "Agile Coach"
            ]
        },
        {
            "level": 3,
            "isEligibleForAsmt": true,
            "jobTitles": [
                "Senior Agile Coach"
            ]
        },
        {
            "level": 4,
            "isEligibleForAsmt": true,
            "jobTitles": [
                "Lead Agile Coach"
            ]
        },
        {
            "level": 5,
            "isEligibleForAsmt": true,
            "jobTitles": [
                "Chief Agile Coach"
            ]
        }
    ],
    "id": "16e696e5-2be4-8e23-743e-64254b8df65c",
    "_rid": "nEl0AILL7gIeAAAAAAAAAA==",
    "_self": "dbs/nEl0AA==/colls/nEl0AILL7gI=/docs/nEl0AILL7gIeAAAAAAAAAA==/",
    "_etag": "\"00002600-0000-0000-0000-58e400ab0000\"",
    "_attachments": "attachments/",
    "_ts": 1491337387
}