{
    "jobFunction": {
        "id": 40,
        "name": "Legal",
        "mnemonicBase": "L",
        "track": 0
    },
    "sections": [
        {
            "caption": null,
            "rows": [
                {
                    "name": "Professional Experience and Knowledge",
                    "cells": [
                        "<p>Works closely with the legal team in supporting day to day legal activities. Regular process control is required.</p><p>Expected to have at least 1 year of relevant experience, ideally with a reputable private law firm.  A law degree  from an accredited institution.  Must have and maintain active professional licensure for relevant jurisdiction(s).</p>",
                        "<p>Works closely with the legal team in supporting day to day legal activities. Expected to have at least 2 years of relevant experience, with at least 1 year with a reputable private law firm and at least 1 year in an in-house legal department of a commercial company.  A law degree from an accredited institution.  Must have and maintain active professional licensure for relevant jurisdiction(s).</p>",
                        "<p>Expected to have at least 4 years of relevant post-qualification experience, with at least 1 year with a reputable private law firm and at least 1 year in an in-house legal department of a commercial company. A law degree from an accredited institution.  Must have and maintain active professional licensure for relevant jurisdiction(s).</p>",
                        "<p>Expected to have at least 6 years of legal practice experience with at least 1 year with a reputable private law firm and at least 1 year in an in-house legal department of a commercial company. Proven experience of legal support for commercial operations in at least 2 jurisdictions.</p><p>A law degree from an accredited institution.  Must have and maintain active professional licensure for relevant jurisdiction(s).</p>",
                        "<p>Expected to have at least 8 years of legal practice experience, preferably at least 3 years at a large reputable private law firm and at least 2 years in an in-house legal department of a commercial company (ideally a global company). Proven outstanding track record of success in working with law firms or a large private corporations and managing large multi-disciplinary legal teams. Proven experience of legal support for commercial operations in at least 3 jurisdictions. A law degree from an accredited institution.  Must have and maintain active professional licensure for relevant jurisdiction(s).</p>"
                    ]
                },
                {
                    "name": "Design and Documentation Skills ",
                    "cells": [
                        "<p>Provides professional legal support service to attorneys in the form of basic legal research, drafting of legal and business communications, and general file management. Keep up to date and accurate records of all correspondence and advice given using the internal systems.</p>",
                        "<p>Provides professional legal support service to attorneys in the form of basic legal research.. Prepare simple legal contracts, and other documents related to a variety of trade, commercial, financial, and operational matters (e.g., NDA’s, purchasing agreements, lease agreements,  services agreements with vendors, agreements among EPAM entities, employment contracts, etc.) to protect the organization’s legal and business interests.</p>",
                        "<p>Able to analyze and interpret case law, court reports, and proposed and existing laws and regulations to prepare technical reports on how they impact the organization’s operations. Prepare legal contracts, letters of engagement and other documents related to a variety of trade, commercial, financial, and operational matters (e.g., loans, leases, distribution agreements, NDA’s, purchasing agreements, acquisitions, divestitures, employment contracts, etc.) to protect the organization’s legal and business interests.</p>",
                        "<p>Able to oversee, monitor and review legal activities and deliverables ensuring compliance with organizational policies and legal requirements. Identifying legal risks and developing and managing contingency plans to address such risks. Assist with the variation, extension, termination or re-scoping of contracts. Translate complex legal and compliance requirements into practical workable solutions for the business.</p>",
                        "<p>Lead significant projects relating to legal issues and compliance issues. Lead and perform legal services regarding complex transactions. Point of escalation for other team members and the business.</p><p> </p><p>Legal review of all client engagement documentation including drafting, negotiating and reviewing of agreements and terms (EPAM Systems’ and third parties’), reports, release and reliance agreements.</p><p> </p><p> </p>"
                    ]
                },
                {
                    "name": "Job Titles",
                    "cells": [
                        "<p>Junior Lawyer</p>",
                        "<p>Lawyer</p>",
                        "<p>Senior Lawyer</p>",
                        "<p>Lead Lawyer</p>",
                        "<p>Chief Lawyer</p>"
                    ]
                },
                {
                    "name": "Reliability",
                    "cells": [
                        "<p>Expected to work effectively under thorough supervision and to perform certain simple legal activities in accordance with the established standards. Provides support to the legal team in less complex legal tasks.</p><p> </p><p>Individual Contributor.</p>",
                        "<p>Expected to work effectively under supervision and to perform a variety of simple legal activities in accordance with the established standards. Provides support to the legal team in less complex legal tasks.</p><p> </p><p>Individual Contributor.</p>",
                        "<p>Expected to work independently without direct supervision. Participates in in a variety of assigned legal projects. Address general and ad-hoc legal queries from internal business stakeholders. Assist in the development of internal procedures and best practice and compilation of precedents and know how to support multiple business units and ensure they are in compliance with laws. Advises management on recent changes in laws and regulations that affect the company.   Lead complex contract negotiations.</p><p> </p><p>Individual Contributor; may have some management duties.</p>",
                        "<p>Expected to represent the organization in  legal proceedings before courts, where permitted by law. Ensures that business practices, policies, and dealings of the Company meet regulatory requirements to protect the organization from legal action. Manages the organization’s defense, the interpretation and preparation of legal documents. Review and approve public statements from a legal standpoint to identify, anticipate and mitigate legal risks. Responsible for managing and developing junior members of a legal team. Possess excellent negotiation and people skills.</p><p> </p><p>Individual Contributor (may have some management duties) or Managerial Contributor.</p>",
                        "<p>Expected to represent the organization in  important legal proceedings before courts where permitted by law, government agencies, or other authorities so the organization’s interests are protected. Lead complex contract negotiations. Able to resolve the most difficult and complex legal issues; ability to multi-task in fast paced environment and to lead various initiatives.</p><p> </p><p>Individual Contributor (may have some management duties) with subject matter expertise or Managerial Contributor with subject matter expertise.</p>"
                    ]
                },
                {
                    "name": "Quality",
                    "cells": [
                        "<p>Understands and follows the established company policies, procedures and legal standards.</p>",
                        "<p>Understands and follows the established company policies, procedures and legal standards. By working alongside senior general counsel and other in-house attorneys develops skills and deeper knowledge in drafting corporate documents, strategic thinking, negotiating, counseling, litigation, governance, and compliance.</p>",
                        "<p> Able to coach, mentor and support less experienced legal staff and help them resolve complex problems and legal cases. </p>",
                        "<p>Able to coach, mentor and support less experienced legal staff and help them resolve complex problems and legal cases. </p>",
                        "<p>Develop and assists in setting legal procedures, policies and guidelines.</p>"
                    ]
                },
                {
                    "name": "Customer Relations",
                    "cells": [
                        "<p>Not required to communicate directly with customers.  Able to maintain strict confidentiality, handle sensitive issues and information, exercise appropriate discretion and demonstrate sound judgment.</p>",
                        "<p>Required to communicate directly with customers.  Able to maintain strict confidentiality, handle sensitive issues and information, exercise appropriate discretion and demonstrate sound judgment.</p>",
                        "<p>Required to communicate directly with customers.  Able to maintain strict confidentiality, handle sensitive issues and information, exercise appropriate discretion and demonstrate sound judgment.</p>",
                        "<p>Able to communicate directly and independently with customers.   Able to maintain strict confidentiality, handle sensitive issues and information, exercise appropriate discretion and demonstrate sound judgment.</p>",
                        "<p>Excellent communicator who is able to maintain good working relationship with various stakeholders and work in a fast paced environment, with strict timescales.  Able to maintain strict confidentiality, handle sensitive issues and information, exercise appropriate discretion and demonstrate sound judgment.</p>"
                    ]
                },
                {
                    "name": "English Language Ability",
                    "cells": [
                        "<p>CIS location–A1\\A2indicatively</p><p>Non-CIS location—B1/B2</p>",
                        "<p>CIS location–A2\\B1– indicatively</p><p>Non-CIS location—C1/C2</p>",
                        "<p>CIS location–B1 – indicatively</p><p>Non-CIS location—C1/C2</p>",
                        "<p>CIS location–B1/B2 – indicatively</p><p>Non-CIS location—C1/C2</p>",
                        "<p>C2</p>"
                    ]
                }
            ]
        }
    ],
    "levels": [
        {
            "level": 1,
            "isEligibleForAsmt": false,
            "jobTitles": [
                "Junior Lawyer"
            ]
        },
        {
            "level": 2,
            "isEligibleForAsmt": false,
            "jobTitles": [
                "Lawyer"
            ]
        },
        {
            "level": 3,
            "isEligibleForAsmt": false,
            "jobTitles": [
                "Senior Lawyer"
            ]
        },
        {
            "level": 4,
            "isEligibleForAsmt": false,
            "jobTitles": [
                "Lead Lawyer"
            ]
        },
        {
            "level": 5,
            "isEligibleForAsmt": false,
            "jobTitles": [
                "Chief Lawyer"
            ]
        }
    ],
    "id": "537564be-d00d-1a50-6ce6-b0f0e4ea11b9",
    "_rid": "nEl0AILL7gIiAAAAAAAAAA==",
    "_self": "dbs/nEl0AA==/colls/nEl0AILL7gI=/docs/nEl0AILL7gIiAAAAAAAAAA==/",
    "_etag": "\"00002a00-0000-0000-0000-58e400e40000\"",
    "_attachments": "attachments/",
    "_ts": 1491337444
}